---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInQuarterWidth
source: html/9319279c-d6dc-72f5-fa4d-2e9b1b4feb10.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInQuarterWidth Method

Returns thickness of flange measured in the 0.25 * width,
 sometimes used for sections with width <= 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInQuarterWidth()
```